---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder
source: html/7c9bbd6f-7990-2894-b1cf-09a0d98a88cd.htm
---
# FieldBuilder Properties

Specifies whether the .NET object represents a valid Revit entity.